<?php
    return [    
        'utilities' => 'উপযোগিতা',
        'clear_cache' => 'ক্যাশে সাফ করুন',
        'clear_log' => 'পরিষ্কার লগ',
        'enable' => 'সক্ষম করুন',
        'disable' => 'নিষ্ক্রিয় করুন',
        'app_debug' => 'অ্যাপ ডিবাগ',
        'force_https' => 'HTTPS জোর করুন',
        'reset_database' => 'ডাটাবেস রিসেট করুন',
        'xml_sitemap' => 'এক্সএমএল সাইটম্যাপ',
        'It can take some times to execute operation. please wait until completed operation' => 'অপারেশন চালানোর জন্য কিছু সময় লাগতে পারে। অপারেশন সম্পন্ন না হওয়া পর্যন্ত অপেক্ষা করুন',
        'import_demo_database' => 'ডেমো ডেটাবেস আমদানি করুন',
        'import_database' => 'ডাটাবেস আমদানি করুন',
        'import_demo_note' => 'ডেমো আমদানি করার পরে, আপনি আপনার বর্তমান ডেটা হারিয়ে ফেলবেন। আপনার প্রয়োজন হলে প্রথমে আপনার ডাটাবেস এবং আপলোড করা ফাইলের ব্যাকআপ করুন।',
        'reset_database_note' => 'রিসেট করার পরে, আপনি আপনার বর্তমান ডেটা হারাবেন। আপনার প্রয়োজন হলে প্রথমে আপনার ডাটাবেস এবং আপলোড করা ফাইলের ব্যাকআপ করুন।',
        'are_you_sure_to_import_demo_database' => 'আপনি ডেমো ডাটাবেস আমদানি করতে নিশ্চিত?'
    ]
?>