<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'বিষয়টি অবশ্যই গ্রহণ করতে হবে।',
    'active_url' => 'বৈশিষ্ট্য একটি বৈধ url নয়।',
    'after' => 'বৈশিষ্ট্যটি অবশ্যই একটি তারিখের পর তারিখ হতে হবে।',
    'after_or_equal' => 'বৈশিষ্ট্যটি অবশ্যই তারিখের পরে বা তার সমান হতে হবে৷',
    'alpha' => 'অ্যাট্রিবিউটে শুধুমাত্র অক্ষর থাকতে পারে।',
    'alpha_dash' => 'অ্যাট্রিবিউটে শুধুমাত্র অক্ষর, সংখ্যা, ড্যাশ এবং আন্ডারস্কোর থাকতে পারে।',
    'alpha_num' => 'অ্যাট্রিবিউটে শুধুমাত্র অক্ষর এবং সংখ্যা থাকতে পারে।',
    'array' => 'বৈশিষ্ট্য একটি অ্যারে হতে হবে.',
    'before' => 'বৈশিষ্ট্যটি অবশ্যই তারিখের আগে একটি তারিখ হতে হবে।',
    'before_or_equal' => 'বৈশিষ্ট্যটি অবশ্যই তারিখের আগে বা তার সমান হতে হবে৷',
    'boolean' => 'বৈশিষ্ট্য ক্ষেত্র সত্য বা মিথ্যা হতে হবে',
    'confirmed' => 'বৈশিষ্ট্য নিশ্চিতকরণ মেলে না',
    'date' => 'বৈশিষ্ট্য একটি বৈধ তারিখ নয়',
    'date_equals' => 'বৈশিষ্ট্যটি অবশ্যই তারিখের সমান একটি তারিখ হতে হবে।',
    'date_format' => 'বৈশিষ্ট্যটি বিন্যাস বিন্যাসের সাথে মেলে না।',
    'different' => 'বৈশিষ্ট্য এবং অন্যান্য ভিন্ন হতে হবে',
    'digits' => 'অ্যাট্রিবিউটটি অবশ্যই ডিজিট ডিজিট হতে হবে',
    'digits_between' => 'বৈশিষ্ট্যটি সর্বনিম্ন এবং সর্বাধিক সংখ্যার মধ্যে হতে হবে৷',
    'dimensions' => 'অ্যাট্রিবিউটের অবৈধ ইমেজ ডাইমেনশন আছে',
    'distinct' => 'বৈশিষ্ট্য ক্ষেত্রের একটি ডুপ্লিকেট মান আছে',
    'email' => 'বৈশিষ্ট্য একটি বৈধ ইমেল ঠিকানা হতে হবে',
    'ends_with' => 'নিম্নলিখিত মানগুলির মধ্যে একটি দিয়ে বৈশিষ্ট্যটি শেষ হওয়া আবশ্যক৷',
    'exists' => 'নির্বাচিত বৈশিষ্ট্যটি অবৈধ৷',
    'file' => 'বৈশিষ্ট্য একটি ফাইল হতে হবে',
    'filled' => 'বৈশিষ্ট্য ক্ষেত্রের একটি মান থাকতে হবে',
    'image' => 'বৈশিষ্ট্য একটি চিত্র হতে হবে',
    'in' => 'নির্বাচিত বৈশিষ্ট্যটি অবৈধ৷',
    'in_array' => 'এট্রিবিউট ক্ষেত্রটি অন্যের মধ্যে নেই',
    'integer' => 'বৈশিষ্ট্য একটি পূর্ণসংখ্যা হতে হবে',
    'ip' => 'বৈশিষ্ট্য একটি বৈধ IP ঠিকানা হতে হবে',
    'ipv4' => 'বৈশিষ্ট্য একটি বৈধ IPv4 ঠিকানা হতে হবে',
    'ipv6' => 'বৈশিষ্ট্য একটি বৈধ IPv6 ঠিকানা হতে হবে',
    'json' => 'অ্যাট্রিবিউটটি অবশ্যই একটি বৈধ JSON স্ট্রিং হতে হবে',
    
    'mimes' => 'অ্যাট্রিবিউটটি অবশ্যই টাইপ মানগুলির একটি ফাইল হতে হবে',
    'mimetypes' => 'অ্যাট্রিবিউটটি অবশ্যই টাইপ মানগুলির একটি ফাইল হতে হবে',
    
    'multiple_of' => 'অ্যাট্রিবিউটটি অবশ্যই মানের একাধিক হতে হবে',
    'not_in' => 'নির্বাচিত বৈশিষ্ট্যটি অবৈধ৷',
    'not_regex' => 'বৈশিষ্ট্য বিন্যাস অবৈধ',
    'numeric' => 'বৈশিষ্ট্য একটি সংখ্যা হতে হবে',
    'password' => 'পাসওয়ার্ডটি ভূল',
    'present' => 'অ্যাট্রিবিউট ফিল্ড অবশ্যই উপস্থিত থাকতে হবে',
    'regex' => 'বৈশিষ্ট্য বিন্যাস অবৈধ',
    'required' => 'বৈশিষ্ট্য ক্ষেত্র প্রয়োজন',
    'required_if' => 'যখন অন্য মান হয় তখন অ্যাট্রিবিউট ফিল্ড প্রয়োজন হয়',
    'required_unless' => 'অন্যান্য মান না থাকলে বৈশিষ্ট্য ক্ষেত্রটি প্রয়োজন',
    'required_with' => 'মান উপস্থিত থাকলে বৈশিষ্ট্য ক্ষেত্র প্রয়োজন হয়',
    'required_with_all' => 'মান উপস্থিত থাকলে বৈশিষ্ট্য ক্ষেত্র প্রয়োজন হয়',
    'required_without' => 'মান উপস্থিত না থাকলে বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন হয়',
    'required_without_all' => 'কোনো মান উপস্থিত না থাকলে বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন হয়',
    'same' => 'বৈশিষ্ট্য এবং অন্যান্য অবশ্যই মিলবে',
    
    'starts_with' => 'বৈশিষ্ট্যটি অবশ্যই নিম্নলিখিত মানগুলির মধ্যে একটি দিয়ে শুরু হবে৷',
    'string' => 'বৈশিষ্ট্য একটি স্ট্রিং হতে হবে',
    'timezone' => 'বৈশিষ্ট্যটি অবশ্যই একটি বৈধ অঞ্চল হতে হবে৷',
    'unique' => 'বৈশিষ্ট্য ইতিমধ্যে নেওয়া হয়েছে',
    'uploaded' => 'বৈশিষ্ট্য আপলোড করতে ব্যর্থ হয়েছে',
    'url' => 'বৈশিষ্ট্য বিন্যাস অবৈধ',
    'uuid' => 'বৈশিষ্ট্য একটি বৈধ UUID হতে হবে',
    'check_unique_phone' => 'ফোনটা আগেই নেওয়া হয়েছে',
    'this_field_is_required' => 'ঘরটি অবশ্যই পূরণ করতে হবে',
    'please_fill_with_valid_email' => 'বৈধ ইমেল দিয়ে পূরণ করুন',
    'you_are_already_subscribed' => 'আপনাকে ইতিমধ্যে সদস্যতা দেওয়া হয়েছে',
    'the_amount_is_must_be_gretter_than_0' => 'পরিমাণ অবশ্যই 0-এর বেশি হতে হবে'

];
