<?php

return [

    

    'accepted' => 'يجب قبول السمة',
    'active_url' => 'السمة ليست عنوان URL صالحًا',
    'after' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ',
    'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ أو مساويًا له',
    'alpha' => 'قد تحتوي السمة على أحرف فقط',
    'alpha_dash' => 'لا يجوز أن تحتوي السمة إلا على أحرف وأرقام وشرطات وشرطات سفلية',
    'alpha_num' => 'قد تحتوي السمة على أحرف وأرقام فقط',
    'array' => 'يجب أن تكون السمة مصفوفة',
    'before' => 'يجب أن تكون السمة تاريخًا قبل التاريخ',
    'before_or_equal' => 'يجب أن تكون السمة تاريخًا قبل التاريخ أو مساويًا له',
    
    'boolean' => 'يجب أن يكون حقل السمة صحيحًا أو خطأ',
    'confirmed' => 'تأكيد السمة غير متطابق',
    'date' => 'السمة ليست تاريخًا صالحًا',
    'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا للتاريخ',
    'date_format' => 'السمة لا تتطابق مع تنسيق التنسيق',
    'different' => 'يجب أن تكون السمة والأخرى مختلفة',
    'digits' => 'يجب أن تتكون السمة من أرقام',
    'digits_between' => 'يجب أن تكون السمة بين الحد الأدنى والحد الأقصى للأرقام',
    'dimensions' => 'السمة لها أبعاد صورة غير صالحة',
    'distinct' => 'حقل السمة له قيمة مكررة',
    'email' => 'يجب أن تكون السمة عنوان بريد إلكتروني صالحًا',
    'ends_with' => 'يجب أن تنتهي السمة بإحدى القيم التالية',
    'exists' => 'السمة المحددة غير صالحة',
    'file' => 'يجب أن تكون السمة ملفًا',
    'filled' => 'يجب أن يحتوي حقل السمة على قيمة',
    
    
    'image' => 'يجب أن تكون السمة صورة',
    'in' => 'السمة المحددة غير صالحة',
    'in_array' => 'حقل السمة غير موجود في أخرى',
    'integer' => 'يجب أن تكون السمة عددًا صحيحًا',
    'ip' => 'يجب أن تكون السمة عنوان IP صالحًا',
    'ipv4' => 'يجب أن تكون السمة عنوان IPv4 صالحًا',
    'ipv6' => 'يجب أن تكون السمة عنوان IPv6 صالحًا',
    'json' => 'يجب أن تكون السمة سلسلة JSON صالحة',
    

    'mimes' => 'يجب أن تكون السمة ملفًا من قيم النوع',
    'mimetypes' => 'يجب أن تكون السمة ملفًا من قيم النوع',
    
    'multiple_of' => 'يجب أن تكون السمة من مضاعفات القيمة',
    'not_in' => 'السمة المحددة غير صالحة',
    'not_regex' => 'تنسيق السمة غير صالح',
    'numeric' => 'يجب أن تكون السمة رقمًا',
    'password' => 'كلمة المرور غير صحيحة',
    'present' => 'يجب أن يكون حقل السمة موجودًا',
    'regex' => 'تنسيق السمة غير صالح',
    'required' => 'حقل السمة مطلوب',
    'required_if' => 'حقل السمة مطلوب عندما يكون الآخر هو القيمة',
    'required_unless' => 'حقل السمة مطلوب ما لم يكن الآخر في القيم',
    'required_with' => 'حقل السمة مطلوب عندما تكون القيم موجودة',
    'required_with_all' => 'حقل السمة مطلوب عندما تكون القيم موجودة',
    'required_without' => 'حقل السمة مطلوب في حالة عدم وجود القيم',
    'required_without_all' => 'حقل السمة مطلوب في حالة عدم وجود أي من القيم',
    'same' => 'يجب أن تتطابق السمة والأخرى',
    
    'starts_with' => 'يجب أن تبدأ السمة بإحدى القيم التالية',
    'string' => 'يجب أن تكون السمة سلسلة',
    'timezone' => 'يجب أن تكون السمة منطقة صالحة',
    'unique' => 'السمة مأخوذة بالفعل',
    'uploaded' => 'فشل تحميل السمة',
    'url' => 'تنسيق السمة غير صالح',
    'uuid' => 'يجب أن تكون السمة UUID صالحًا',
    'check_unique_phone' => 'تم أخذ الهاتف بالفعل',
    'this_field_is_required' => 'هذه الخانة مطلوبه',
    'please_fill_with_valid_email' => 'يرجى ملء البريد الإلكتروني الصحيح',
    'you_are_already_subscribed' => 'انت مشترك اصلا',
    'the_amount_is_must_be_gretter_than_0' => 'يجب أن يكون المبلغ أكبر من 0'

    


    

];
